CREATE TABLE[dbo].[Товари]
(
   [Код_товару] INT NOT NULL PRIMARY KEY, 
    [Товар] NVARCHAR(50) NOT NULL,
    [Ціна] DECIMAL NOT NULL, 
    [Ціна_закупівлі] DECIMAL NOT NULL 
)
 CREATE TABLE[dbo].[Продажі]
(

   [Код_продажу] INT NOT NULL PRIMARY KEY, 
    [Дата] SMALLDATETIME NOT NULL, 
    [Код_виробника] INT NOT NULL, 
    [Код_товару] INT NOT NULL, 
    [Кількість] INT NOT NULL, 
    CONSTRAINT[FK_Продажі_Виробники] FOREIGN KEY([Код_виробника]) REFERENCES[Виробники] ([Код_виробника])
  on delete cascade

    on update cascade, 
    CONSTRAINT[FK_Продажі_Товари] FOREIGN KEY([Код_виробника]) REFERENCES[Товари] ([Код_товару])
  on delete cascade

    on update cascade
)
/*Вивести такі дані про продажі товарів виробника з кодом
1: Дата, Товар, Ціна, Кількість, Вартість. Дані вивести за спаданням вартості.*/
select Продажі.Дата,Товари.Товар,Товари.Ціна,Продажі.Кількість,
Товари.Ціна*Продажі.Кількість Вартість
from Товари join Продажі
on
Товари.Код_товару=Продажі.Код_товару
join Виробники
on Продажі.Код_виробника=Виробники.Код_виробника
where Виробники.Код_виробника=1
order by Вартість desc

/*Визначити кількість одиниць проданого товару кожного
виду.*/

select Товари.Товар, SUM(Продажі.Кількість)  as Кількість
from
Товари join Продажі
on Товари.Код_товару=Продажі.Код_товару
group by Товари.Товар


select Temp.Товар, sum(Temp.Кількість) Кількість 
from
(select Продажі.Дата,Товари.Товар,Товари.Ціна,Продажі.Кількість,
Товари.Ціна*Продажі.Кількість Вартість
from Товари join Продажі
on
Товари.Код_товару=Продажі.Код_товару
join Виробники
on Продажі.Код_виробника=Виробники.Код_виробника
) as Temp
group by Temp.Товар
